# St7MidPlanePlateProjection

Generates a midplane mesh between two surfaces of selected plates.  Two separate sets of plates should be
selected prior to this call.

long St7MidPlanePlateProjection(long uID, long PlateNum)

Input Parameters

uID

Strand7 model file ID.

PlateNum

The number of a plate on one of the selected sets; this is the master plate.  The mid-plane mesh will be
generated by projecting the set of plates containing the master plate, halfway towards the other set of
plates.

Dependencies
Selection

Plates can be selected using functions in Entity Selection.

Tools – Mesh

Keep Selected

Assigned using St7SetKeepSelect.